<?php



//------------------------------------------------------------------------------
// Расширения
//------------------------------------------------------------------------------
    define('LIB_EXT', '.php');                           // Библиотеки
    define('TEMPL_EXT', '.tpl');                         // Шаблоны
    define('CONFIG_EXT', '.inc');                        // Конфигурация
    define('CONFIG_XML_EXT', '.xml');                    // Конфигурация
    define('CONFIG_CCH_EXT', '.cch');                    // Конфигурация


    define('INC_CFG_EXT','.inc');                        // Конфигурация
    define('CACHE_EXT', '.cch');                         // Кэшь
    define("BLOCK_EXT",".html");                         // Блок

//------------------------------------------------------------------------------
// Префиксы
//------------------------------------------------------------------------------
    define('BACKEND_PREFIX', '_backend');                // администрирование
    define('TERMINAL_PREFIX', '_terminal');              // терминал
    define('PLANNER_PREFIX', '_planner');                // планировщик
    define('DIALOG_PREFIX', '_dialog');                  // планировщик
    define('INSTALL_PREFIX', '_install');                  // планировщик    

//------------------------------------------------------------------------------
// Папки
//------------------------------------------------------------------------------
    define('PROFILES_DIR', $_root . 'profiles/');        // Профили
    define('LOG_DIR', $_root . 'log/');                  // Логфайлы
    define('MODULES_DIR', $_root . 'modules/');          // Модули
    define('TEMP_DIR', $_root . 'temp/');                // Временные файлы
    define('GEN_DATA_PATH', $_root . 'data/');           // Общедоступные файлы
    define('PROTDATA_DIR', PROFILES_DIR . '_data/');     // Закрытые файлы

//------------------------------------------------------------------------------
// URL`ы
//------------------------------------------------------------------------------
    define('GEN_DATA_URL', '/data/');                    // Общедоступные файлы
    define('TEMP_URL', '/temp/');                        // Временные файлы

//------------------------------------------------------------------------------
// Папки профиля
//------------------------------------------------------------------------------
    define('TREE_DIR','_tree');                          // Дерево структуры
    define('CACHE_DIR','_cache');                        // Кешь
    define('CONFIG_DIR','_config');                      // Конфигурация
    define('DATA_DIR','_data');                          // Закрытые данные
    define('TEMPLS_DIR','_templs');                      // Шаблоны
    define('BLOCKS_DIR','_blocks');                      // блоки

//------------------------------------------------------------------------------
// Файлы
//------------------------------------------------------------------------------
    define('NODE_FILE','node.xml');                       // Файл узла
    define('NODE_CACHE_FILE','node.cch');                 // Кешь узла

//------------------------------------------------------------------------------
// Типы страниц
//------------------------------------------------------------------------------
    define("PAGE_ERROR","0");                              // Ошибка
    define("PAGE_MODE_NORMAL","1");                        // Номальный режим
    define("PAGE_MODE_SINGLE","2");                        // ?

?>
